In [1]:
import sqlite3

In [2]:
##connect to an SQLite database
connection=sqlite3.connect('example.db')
connection

In [3]:
cursor=connection.cursor()

In [4]:
##Create a Table
cursor.execute(''' 
Create Table if Not Exists employees(
id Integer Primary Key,
name Text Not Null,
age Integer,
department text
)
''')

##Commit the changes
connection.commit()

In [9]:
cursor.execute("""
INSERT INTO employees (name, age, department)
VALUES
('Amit Sharma', 28, 'HR'),
('Neha Verma', 32, 'Finance'),
('Rahul Das', 25, 'IT'),
('Priya Singh', 29, 'Marketing'),
('Sourav Paul', 35, 'Operations')
""")

connection.commit()

In [14]:
##Query the data from the tab;e
cursor.execute ('Select * from employees')
rows=cursor.fetchall()

##print the queried data
for row in rows:
    print(row)

(1, 'Amit Sharma', 28, 'HR')
(2, 'Neha Verma', 32, 'Finance')
(3, 'Rahul Das', 25, 'IT')
(4, 'Priya Singh', 29, 'Marketing')
(5, 'Sourav Paul', 35, 'Operations')
(6, 'Amit Sharma', 28, 'HR')
(7, 'Neha Verma', 32, 'Finance')
(8, 'Rahul Das', 25, 'IT')
(9, 'Priya Singh', 29, 'Marketing')
(10, 'Sourav Paul', 35, 'Operations')

In [15]:
##Update data in the table
cursor.execute("""
UPDATE employees
SET age = 36
WHERE name = 'Sourav Paul'
""")

connection.commit()

In [16]:
cursor.execute ('Select * from employees')
rows=cursor.fetchall()

##print the queried data
for row in rows:
    print(row)

(1, 'Amit Sharma', 28, 'HR')
(2, 'Neha Verma', 32, 'Finance')
(3, 'Rahul Das', 25, 'IT')
(4, 'Priya Singh', 29, 'Marketing')
(5, 'Sourav Paul', 36, 'Operations')
(6, 'Amit Sharma', 28, 'HR')
(7, 'Neha Verma', 32, 'Finance')
(8, 'Rahul Das', 25, 'IT')
(9, 'Priya Singh', 29, 'Marketing')
(10, 'Sourav Paul', 36, 'Operations')

In [17]:
cursor.execute("""
DELETE FROM employees
WHERE id = 2
""")

connection.commit()

In [19]:
##working with student-data
connection=sqlite3.connect('student-dataset.db')
cursor=connection.cursor()

##create a trable for student data
cursor.execute("""
CREATE TABLE IF NOT EXISTS students (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT NOT NULL,
    age INTEGER,
    gender TEXT,
    course TEXT,
    marks REAL
)
""")

##inserting data into the sales table
cursor.execute("""
INSERT INTO students (name, age, gender, course, marks)
VALUES
('Ayan Das', 20, 'Male', 'Data Science', 85.5),
('Riya Sen', 21, 'Female', 'Computer Science', 92.0),
('Sourav Paul', 22, 'Male', 'AI & ML', 78.0),
('Ananya Roy', 20, 'Female', 'Cyber Security', 88.5),
('Rahul Sharma', 23, 'Male', 'Computer Science', 81.0)
""")

data = [
    ('Amit Das',),
    ('Riya Gupta',),
    ('Sourav Sen',),
    ('Neha Roy',)
]

cursor.executemany("""
INSERT INTO students (name)
VALUES (?)
""", data)

connection.commit()

In [20]:
cursor.execute("SELECT * FROM students")

rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Ayan Das', 20, 'Male', 'Data Science', 85.5)
(2, 'Riya Sen', 21, 'Female', 'Computer Science', 92.0)
(3, 'Sourav Paul', 22, 'Male', 'AI & ML', 78.0)
(4, 'Ananya Roy', 20, 'Female', 'Cyber Security', 88.5)
(5, 'Rahul Sharma', 23, 'Male', 'Computer Science', 81.0)
(6, 'Ayan Das', 20, 'Male', 'Data Science', 85.5)
(7, 'Riya Sen', 21, 'Female', 'Computer Science', 92.0)
(8, 'Sourav Paul', 22, 'Male', 'AI & ML', 78.0)
(9, 'Ananya Roy', 20, 'Female', 'Cyber Security', 88.5)
(10, 'Rahul Sharma', 23, 'Male', 'Computer Science', 81.0)
(11, 'Amit Das', None, None, None, None)
(12, 'Riya Gupta', None, None, None, None)
(13, 'Sourav Sen', None, None, None, None)
(14, 'Neha Roy', None, None, None, None)

In [21]:
cursor.execute("SELECT name FROM students")

for row in cursor.fetchall():
    print(row[0])

Ayan Das
Riya Sen
Sourav Paul
Ananya Roy
Rahul Sharma
Ayan Das
Riya Sen
Sourav Paul
Ananya Roy
Rahul Sharma
Amit Das
Riya Gupta
Sourav Sen
Neha Roy

In [22]:
cursor.execute("SELECT id, name, course, marks FROM students")

for id_, name, course, marks in cursor.fetchall():
    print(f"ID: {id_} | Name: {name} | Course: {course} | Marks: {marks}")

ID: 1 | Name: Ayan Das | Course: Data Science | Marks: 85.5
ID: 2 | Name: Riya Sen | Course: Computer Science | Marks: 92.0
ID: 3 | Name: Sourav Paul | Course: AI & ML | Marks: 78.0
ID: 4 | Name: Ananya Roy | Course: Cyber Security | Marks: 88.5
ID: 5 | Name: Rahul Sharma | Course: Computer Science | Marks: 81.0
ID: 6 | Name: Ayan Das | Course: Data Science | Marks: 85.5
ID: 7 | Name: Riya Sen | Course: Computer Science | Marks: 92.0
ID: 8 | Name: Sourav Paul | Course: AI & ML | Marks: 78.0
ID: 9 | Name: Ananya Roy | Course: Cyber Security | Marks: 88.5
ID: 10 | Name: Rahul Sharma | Course: Computer Science | Marks: 81.0
ID: 11 | Name: Amit Das | Course: None | Marks: None
ID: 12 | Name: Riya Gupta | Course: None | Marks: None
ID: 13 | Name: Sourav Sen | Course: None | Marks: None
ID: 14 | Name: Neha Roy | Course: None | Marks: None

In [23]:

##close the conneciiton
connection.close()